// page/recite/pages/detail-js/detail-js.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    scrollTop:0,
    periods:[
      {
        id:0,
        name: '史前时期',
        height:2500,
        times: [
          { t1: '公元前', t2: '200', unit: '万', title: '工具', desc: '人类用木棍和石块制造出了最初的工具' },
          { t1: '公元前', t2: '40', unit: '万', title: '火', desc: '人类学会了钻木取火或敲击燧石生火' },
          { t1: '公元前', t2: '10', unit: '万', title: '宗教', desc: '人类相信大自然中居住着神灵' },
          { t1: '公元前', t2: '3', unit: '万', title: '弓', desc: '人类发明了弓，用来把箭射到很远的地方。' },
          { t1: '公元前', t2: '1.5', unit: '万', title: '艺术', desc: '人类在洞穴石壁上作画，雕刻小雕像，打造首饰。' },
          { t1: '公元前', t2: '8000', unit: '', title: '农业', desc: '史前时期末叶，人类学会了种植谷物，逐渐过上定居生活。' }
        ]
      },
      {
        id: 1,
        height: 3300,
        name: '古文明时代',
        times: [
          { t1: '公元前', t2: '7000', unit: '', title: '冶金', desc: '人类开始冶炼铜和金之类的金属，用来打造首饰。' },
          { t1: '公元前', t2: '4500', unit: '', title: '驯养马匹', desc: '人类驯养马匹，最初是为了吃马肉、喝马奶。' },
          { t1: '公元前', t2: '4000', unit: '', title: '制陶转盘', desc: '有了制陶转盘，人们就能造出形状更规则、更轻巧的器物。' },
          { t1: '公元前', t2: '3500', unit: '', title: '车轮', desc: '人类受陶瓷转盘的启发，发明了车轮。' },
          { t1: '公元前', t2: '3200', unit: '', title: '文字', desc: '苏美尔人，发明了楔形文字。' },
          { t1: '公元前', t2: '1500', unit: '', title: '铁器', desc: '人们学会了用铁制作工具和武器' },
          { t1: '公元前', t2: '550', unit: '', title: '货币', desc: '货币逐渐固定为用金或银制成。' },
          { t1: '公元前', t2: '105', unit: '', title: '造纸', desc: '中国人发明了纸张和大规模造纸的方法。' },
        ]
      },
      {
        id: 2,
        height: 2500,
        name:'中世纪',
        times:[
          {t1:'公元',t2:'600',unit:'',title:'风车磨坊',desc:'人们用风车汲水灌溉水田，将谷物磨成面粉'},
          { t1: '公元', t2: '980', unit: '', title: '船闸', desc: '中国人最早建造船闸'},
          { t1: '约公元', t2: '1000', unit: '', title: '指南针和船舵', desc: '中国人发明了指南针和船舵' },
          { t1: '公元', t2: '1045', unit: '', title: '印刷术', desc: '中国人毕昇首创泥活字印刷术，1450年，德国人谷登堡改良了这项技术' },
          { t1: '公元', t2: '1100', unit: '', title: '马颈轭', desc: '农民发明了这种套在马匹肩部的轭' },
          { t1: '公元', t2: '1300', unit: '', title: '火炮', desc: '在发明火药之后，中国人最早制造了火炮' }
        ]
      },
      {
        id: 3,
        name: '文艺复兴时期',
        height: 2500,
        times: [
          { t1: '公元', t2: '1506', unit: '', title: '蒙娜丽莎', desc: '列奥纳多·达·芬奇完成了画作《蒙娜丽莎》' },
          { t1: '公元', t2: '1543', unit: '', title: '日心说', desc: '尼古拉·哥白尼证明地球围绕太阳旋转' },
          { t1: '公元', t2: '1564', unit: '', title: '外科手术', desc: '法国人安布鲁瓦兹·帕雷发明了现代外科手术' },
          { t1: '公元', t2: '1569', unit: '', title: '地图绘制', desc: '数学家和地理学家赫拉尔杜斯。墨卡托发明了一种全新的地图绘制方法' },
          { t1: '公元', t2: '1573', unit: '', title: '西红柿', desc: '西班牙人从南美洲带会一种欧洲人没见过的蔬菜：西红柿！' },
          { t1: '公元', t2: '1590', unit: '', title: '显微镜', desc: '显微镜可以让我们观察那些肉眼看不见的微小东西，比如细胞、微生物等' }
        ]
      },
      {
        id: 4,
        name: '启蒙时代',
        height: 3300,
        times: [
          { t1: '公元', t2: '1609', unit: '', title: '天文望远镜', desc: '意大利学者伽利略是第一位使用天文望远镜观测量体的人' },
          { t1: '公元', t2: '1681', unit: '', title: '蒸汽机', desc: '物理学家丹尼斯·帕潘构想出了最初的蒸汽机；100年后，詹姆斯·瓦特让蒸汽机发挥出巨大作用' },
          { t1: '公元', t2: '1687', unit: '', title: '万有引力', desc: '艾萨克·牛顿用万有引力定律解释了星球之间的运动。' },
          { t1: '公元', t2: '1730', unit: '', title: '六分仪', desc: '六分仪能帮助水手在远洋航行中确定自己的位置。' },
          { t1: '公元', t2: '1756', unit: '', title: '莫扎特', desc: '莫扎特跨越了时代，成为世界上最伟大的音乐家之一' },
          { t1: '公元', t2: '1769', unit: '', title: '蒸汽车', desc: '法国人居纽发明了最早的汽车：一辆靠蒸汽机驱动的三轮汽车' },
          { t1: '公元', t2: '1783', unit: '', title: '热气球', desc: '孟格菲兄弟首次搭乘热气球在空中飞行' },
          { t1: '公元', t2: '1789', unit: '', title: '《人权宣言》', desc: '这篇宣言宣称“人人生而平等、自由”' }
        ]
      },
      {
        id: 5,
        name: '工业革命时期',
        height: 3300,
        times: [
          { t1: '公元', t2: '1800', unit: '', title: '潜艇', desc: '世界上最早的潜艇之一“鹦鹉螺号”，由罗伯特·富尔顿设计建造' },
          { t1: '公元', t2: '1816', unit: '', title: '摄影术', desc: '尼瑟福·尼埃普斯发明了摄影术' },
          { t1: '公元', t2: '1825', unit: '', title: '火车', desc: '第一列载客列车在英国完成运行，速度可达每小时20千米' },
          { t1: '公元', t2: '1859', unit: '', title: '进化论', desc: '查尔斯·达尔文发表了生物进化论学说' },
          { t1: '公元', t2: '1872', unit: '', title: '电灯', desc: '英国人约瑟夫·斯旺发明电灯泡，取代了油灯。' },
          { t1: '公元', t2: '1876', unit: '', title: '电话', desc: '好几位发明家都曾制造出电话机，但最出名的要数格拉汉姆·贝尔。' },
          { t1: '公元', t2: '1886', unit: '', title: '汽油汽车', desc: '卡尔·本茨制造出了第一辆装配汽油发动机的汽车，但它只有三个轮子！' },
          { t1: '公元', t2: '1895', unit: '', title: '电影', desc: '首次公开放映电影的是卢米埃兄弟。' }
        ]
      },
      {
        id: 6,
        name: '20世纪',
        height: 3300,
        times: [
          { t1: '公元', t2: '1903', unit: '', title: '飞机', desc: '莱特兄弟实现了第一架完全受控的引擎飞机“飞行者”升空飞行' },
          { t1: '公元', t2: '1903', unit: '', title: '放射性', desc: '玛丽·居里、皮埃尔·居里以及亨利·贝克勒尔，因为在放射性方面的研究而获得了诺贝尔奖。' },
          { t1: '公元', t2: '1915', unit: '', title: '相对论', desc: '阿尔伯特·爱因斯坦发表了一种看待世界的全新理论：广义相对论。' },
          { t1: '公元', t2: '1945', unit: '', title: '电视', desc: '一群工程师发明了电视。最初的电视影像都是黑白的。' },
          { t1: '公元', t2: '1961', unit: '', title: '火箭', desc: '一枚苏联火箭将第一名航天员尤里·加加林送上太空。' },
          { t1: '公元', t2: '1969', unit: '', title: '登月', desc: '“阿波罗11号”于当年7月16日发射升空。' },
          { t1: '公元', t2: '1981', unit: '', title: '计算机', desc: '微型计算机进入普通家庭' },
          { t1: '公元', t2: '2000', unit: '', title: '互联网', desc: '到了2000年，连接互联网的计算机数量已超过3亿台。' }
        ]
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    this.setData({
      scrollTop: 'p-'+options.id
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})